Revit 2027 API
TrussMemberType Enumeration
Indicates the "kind" of a truss member.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TrussMemberType
Public Enumeration TrussMemberType
public enum class TrussMemberType
type TrussMemberType
Members
Member name | Value | Description
ETK_TrussBottomChord | 2 | Truss bottom chord.
ETK_TrussDiagWeb | 4 | Truss DiagWeb.
ETK_TrussTopChord | 1 | Truss top chord.
ETK_TrussVertWeb | 3 | Truss VertWeb.
ETK_Unknown | 0 | Unknown element type.
See Also
Reference
Autodesk.Revit.DB.Structure Namespace